zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_TRDC.h
#define TRDC_MDA_W0_0_ANTIPOL_DFMT0_DID_ANTIPOL_MASK (0xFU)
#define TRDC_MDA_W0_0_ANTIPOL_DFMT0_DID_ANTIPOL_SHIFT (0U)
/*! DID_ANTIPOL - Anti-pol Domain identifier */
#define TRDC_MDA_W0_0_ANTIPOL_DFMT0_DID_ANTIPOL(x) (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_0_ANTIPOL_DFMT0_DID_ANTIPOL_SHIFT)) & TRDC_MDA_W0_0_ANTIPOL_DFMT0_DID_ANTIPOL_MASK)

#define TRDC_MDA_W0_0_ANTIPOL_DFMT0_SA_ANTIPOL_MASK (0xC000U)
#define TRDC_MDA_W0_0_ANTIPOL_DFMT0_SA_ANTIPOL_SHIFT (14U)
/*! SA_ANTIPOL - Anti-pol Secure attribute
 *  0b00..Use the bus master's secure/nonsecure attribute directly.
 *  0b01..Use the bus master's secure/nonsecure attribute directly.
 *  0b10..Force the bus attribute for this master to nonsecure.
 *  0b11..Force the bus attribute for this master to secure.
 */
#define TRDC_MDA_W0_0_ANTIPOL_DFMT0_SA_ANTIPOL(x) (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_0_ANTIPOL_DFMT0_SA_ANTIPOL_SHIFT)) & TRDC_MDA_W0_0_ANTIPOL_DFMT0_SA_ANTIPOL_MASK)

#define TRDC_MDA_W0_0_ANTIPOL_DFMT0_LK3_MASK     (0x40000000U)
#define TRDC_MDA_W0_0_ANTIPOL_DFMT0_LK3_SHIFT    (30U)
/*! LK3 - 1-bit Lock
 *  0b0..Register can be written by any secure privileged write.
 *  0b1..Register is locked (read-only) until the next reset.
 */
#define TRDC_MDA_W0_0_ANTIPOL_DFMT0_LK3(x)       (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_0_ANTIPOL_DFMT0_LK3_SHIFT)) & TRDC_MDA_W0_0_ANTIPOL_DFMT0_LK3_MASK)
/*! @} */

/*! @name MDA_W0_1_ANTIPOL_DFMT0 - DAC Master Domain Assignment Anti-pol Register */
/*! @{ */

#define TRDC_MDA_W0_1_ANTIPOL_DFMT0_DID_ANTIPOL_MASK (0xFU)
#define TRDC_MDA_W0_1_ANTIPOL_DFMT0_DID_ANTIPOL_SHIFT (0U)
/*! DID_ANTIPOL - Anti-pol Domain identifier */
#define TRDC_MDA_W0_1_ANTIPOL_DFMT0_DID_ANTIPOL(x) (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_1_ANTIPOL_DFMT0_DID_ANTIPOL_SHIFT)) & TRDC_MDA_W0_1_ANTIPOL_DFMT0_DID_ANTIPOL_MASK)

#define TRDC_MDA_W0_1_ANTIPOL_DFMT0_SA_ANTIPOL_MASK (0xC000U)
#define TRDC_MDA_W0_1_ANTIPOL_DFMT0_SA_ANTIPOL_SHIFT (14U)
/*! SA_ANTIPOL - Anti-pol Secure attribute
 *  0b00..Use the bus master's secure/nonsecure attribute directly.
 *  0b01..Use the bus master's secure/nonsecure attribute directly.
 *  0b10..Force the bus attribute for this master to nonsecure.
 *  0b11..Force the bus attribute for this master to secure.
 */
#define TRDC_MDA_W0_1_ANTIPOL_DFMT0_SA_ANTIPOL(x) (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_1_ANTIPOL_DFMT0_SA_ANTIPOL_SHIFT)) & TRDC_MDA_W0_1_ANTIPOL_DFMT0_SA_ANTIPOL_MASK)

#define TRDC_MDA_W0_1_ANTIPOL_DFMT0_LK3_MASK     (0x40000000U)
#define TRDC_MDA_W0_1_ANTIPOL_DFMT0_LK3_SHIFT    (30U)
/*! LK3 - 1-bit Lock
 *  0b0..Register can be written by any secure privileged write.
 *  0b1..Register is locked (read-only) until the next reset.
 */
#define TRDC_MDA_W0_1_ANTIPOL_DFMT0_LK3(x)       (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_1_ANTIPOL_DFMT0_LK3_SHIFT)) & TRDC_MDA_W0_1_ANTIPOL_DFMT0_LK3_MASK)
/*! @} */

/*! @name MDA_W0_2_ANTIPOL_DFMT1 - DAC Master Domain Assignment Anti-pol Register */
/*! @{ */

#define TRDC_MDA_W0_2_ANTIPOL_DFMT1_DID_ANTIPOL_MASK (0xFU)
#define TRDC_MDA_W0_2_ANTIPOL_DFMT1_DID_ANTIPOL_SHIFT (0U)
/*! DID_ANTIPOL - Anti-pol Domain identifier */
#define TRDC_MDA_W0_2_ANTIPOL_DFMT1_DID_ANTIPOL(x) (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_2_ANTIPOL_DFMT1_DID_ANTIPOL_SHIFT)) & TRDC_MDA_W0_2_ANTIPOL_DFMT1_DID_ANTIPOL_MASK)

#define TRDC_MDA_W0_2_ANTIPOL_DFMT1_PA_ANTIPOL_MASK (0x30U)
#define TRDC_MDA_W0_2_ANTIPOL_DFMT1_PA_ANTIPOL_SHIFT (4U)
/*! PA_ANTIPOL - Anti-pol Privileged attribute
 *  0b00..Use the bus master's privileged/user attribute directly.
 *  0b01..Use the bus master's privileged/user attribute directly.
 *  0b10..Force the bus attribute for this master to privileged.
 *  0b11..Force the bus attribute for this master to user.
 */
#define TRDC_MDA_W0_2_ANTIPOL_DFMT1_PA_ANTIPOL(x) (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_2_ANTIPOL_DFMT1_PA_ANTIPOL_SHIFT)) & TRDC_MDA_W0_2_ANTIPOL_DFMT1_PA_ANTIPOL_MASK)

#define TRDC_MDA_W0_2_ANTIPOL_DFMT1_SA_ANTIPOL_MASK (0xC0U)
#define TRDC_MDA_W0_2_ANTIPOL_DFMT1_SA_ANTIPOL_SHIFT (6U)
/*! SA_ANTIPOL - Anti-pol Secure attribute
 *  0b00..Use the bus master's secure/nonsecure attribute directly.
 *  0b01..Use the bus master's secure/nonsecure attribute directly.
 *  0b10..Force the bus attribute for this master to nonsecure.
 *  0b11..Force the bus attribute for this master to secure.
 */
#define TRDC_MDA_W0_2_ANTIPOL_DFMT1_SA_ANTIPOL(x) (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_2_ANTIPOL_DFMT1_SA_ANTIPOL_SHIFT)) & TRDC_MDA_W0_2_ANTIPOL_DFMT1_SA_ANTIPOL_MASK)

#define TRDC_MDA_W0_2_ANTIPOL_DFMT1_LK3_MASK     (0x40000000U)
#define TRDC_MDA_W0_2_ANTIPOL_DFMT1_LK3_SHIFT    (30U)
/*! LK3 - 1-bit Lock
 *  0b0..Register can be written by any secure privileged write.
 *  0b1..Register is locked (read-only) until the next reset.
 */
#define TRDC_MDA_W0_2_ANTIPOL_DFMT1_LK3(x)       (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_2_ANTIPOL_DFMT1_LK3_SHIFT)) & TRDC_MDA_W0_2_ANTIPOL_DFMT1_LK3_MASK)
/*! @} */

/*! @name MDA_W0_3_ANTIPOL_DFMT1 - DAC Master Domain Assignment Anti-pol Register */
/*! @{ */

#define TRDC_MDA_W0_3_ANTIPOL_DFMT1_DID_ANTIPOL_MASK (0xFU)
#define TRDC_MDA_W0_3_ANTIPOL_DFMT1_DID_ANTIPOL_SHIFT (0U)
/*! DID_ANTIPOL - Anti-pol Domain identifier */
#define TRDC_MDA_W0_3_ANTIPOL_DFMT1_DID_ANTIPOL(x) (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_3_ANTIPOL_DFMT1_DID_ANTIPOL_SHIFT)) & TRDC_MDA_W0_3_ANTIPOL_DFMT1_DID_ANTIPOL_MASK)

#define TRDC_MDA_W0_3_ANTIPOL_DFMT1_PA_ANTIPOL_MASK (0x30U)
#define TRDC_MDA_W0_3_ANTIPOL_DFMT1_PA_ANTIPOL_SHIFT (4U)
/*! PA_ANTIPOL - Anti-pol Privileged attribute
 *  0b00..Use the bus master's privileged/user attribute directly.
 *  0b01..Use the bus master's privileged/user attribute directly.
 *  0b10..Force the bus attribute for this master to privileged.
 *  0b11..Force the bus attribute for this master to user.
 */
#define TRDC_MDA_W0_3_ANTIPOL_DFMT1_PA_ANTIPOL(x) (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_3_ANTIPOL_DFMT1_PA_ANTIPOL_SHIFT)) & TRDC_MDA_W0_3_ANTIPOL_DFMT1_PA_ANTIPOL_MASK)

#define TRDC_MDA_W0_3_ANTIPOL_DFMT1_SA_ANTIPOL_MASK (0xC0U)
#define TRDC_MDA_W0_3_ANTIPOL_DFMT1_SA_ANTIPOL_SHIFT (6U)
/*! SA_ANTIPOL - Anti-pol Secure attribute
 *  0b00..Use the bus master's secure/nonsecure attribute directly.
 *  0b01..Use the bus master's secure/nonsecure attribute directly.
 *  0b10..Force the bus attribute for this master to nonsecure.
 *  0b11..Force the bus attribute for this master to secure.
 */
#define TRDC_MDA_W0_3_ANTIPOL_DFMT1_SA_ANTIPOL(x) (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_3_ANTIPOL_DFMT1_SA_ANTIPOL_SHIFT)) & TRDC_MDA_W0_3_ANTIPOL_DFMT1_SA_ANTIPOL_MASK)

#define TRDC_MDA_W0_3_ANTIPOL_DFMT1_LK3_MASK     (0x40000000U)
#define TRDC_MDA_W0_3_ANTIPOL_DFMT1_LK3_SHIFT    (30U)
/*! LK3 - 1-bit Lock
 *  0b0..Register can be written by any secure privileged write.
 *  0b1..Register is locked (read-only) until the next reset.
 */
#define TRDC_MDA_W0_3_ANTIPOL_DFMT1_LK3(x)       (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_3_ANTIPOL_DFMT1_LK3_SHIFT)) & TRDC_MDA_W0_3_ANTIPOL_DFMT1_LK3_MASK)
/*! @} */

/*! @name MDA_W0_4_ANTIPOL_DFMT1 - DAC Master Domain Assignment Anti-pol Register */
/*! @{ */

#define TRDC_MDA_W0_4_ANTIPOL_DFMT1_DID_ANTIPOL_MASK (0xFU)
#define TRDC_MDA_W0_4_ANTIPOL_DFMT1_DID_ANTIPOL_SHIFT (0U)
/*! DID_ANTIPOL - Anti-pol Domain identifier */
#define TRDC_MDA_W0_4_ANTIPOL_DFMT1_DID_ANTIPOL(x) (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_4_ANTIPOL_DFMT1_DID_ANTIPOL_SHIFT)) & TRDC_MDA_W0_4_ANTIPOL_DFMT1_DID_ANTIPOL_MASK)

#define TRDC_MDA_W0_4_ANTIPOL_DFMT1_PA_ANTIPOL_MASK (0x30U)
#define TRDC_MDA_W0_4_ANTIPOL_DFMT1_PA_ANTIPOL_SHIFT (4U)
/*! PA_ANTIPOL - Anti-pol Privileged attribute
 *  0b00..Use the bus master's privileged/user attribute directly.
 *  0b01..Use the bus master's privileged/user attribute directly.
 *  0b10..Force the bus attribute for this master to privileged.
 *  0b11..Force the bus attribute for this master to user.
 */
#define TRDC_MDA_W0_4_ANTIPOL_DFMT1_PA_ANTIPOL(x) (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_4_ANTIPOL_DFMT1_PA_ANTIPOL_SHIFT)) & TRDC_MDA_W0_4_ANTIPOL_DFMT1_PA_ANTIPOL_MASK)

#define TRDC_MDA_W0_4_ANTIPOL_DFMT1_SA_ANTIPOL_MASK (0xC0U)
#define TRDC_MDA_W0_4_ANTIPOL_DFMT1_SA_ANTIPOL_SHIFT (6U)
/*! SA_ANTIPOL - Anti-pol Secure attribute
 *  0b00..Use the bus master's secure/nonsecure attribute directly.
 *  0b01..Use the bus master's secure/nonsecure attribute directly.
 *  0b10..Force the bus attribute for this master to nonsecure.
 *  0b11..Force the bus attribute for this master to secure.
 */
#define TRDC_MDA_W0_4_ANTIPOL_DFMT1_SA_ANTIPOL(x) (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_4_ANTIPOL_DFMT1_SA_ANTIPOL_SHIFT)) & TRDC_MDA_W0_4_ANTIPOL_DFMT1_SA_ANTIPOL_MASK)

#define TRDC_MDA_W0_4_ANTIPOL_DFMT1_LK3_MASK     (0x40000000U)
#define TRDC_MDA_W0_4_ANTIPOL_DFMT1_LK3_SHIFT    (30U)
/*! LK3 - 1-bit Lock
 *  0b0..Register can be written by any secure privileged write.
 *  0b1..Register is locked (read-only) until the next reset.
 */
#define TRDC_MDA_W0_4_ANTIPOL_DFMT1_LK3(x)       (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_4_ANTIPOL_DFMT1_LK3_SHIFT)) & TRDC_MDA_W0_4_ANTIPOL_DFMT1_LK3_MASK)
/*! @} */

/*! @name MDA_W0_5_ANTIPOL_DFMT1 - DAC Master Domain Assignment Anti-pol Register */
/*! @{ */

#define TRDC_MDA_W0_5_ANTIPOL_DFMT1_DID_ANTIPOL_MASK (0xFU)
#define TRDC_MDA_W0_5_ANTIPOL_DFMT1_DID_ANTIPOL_SHIFT (0U)
/*! DID_ANTIPOL - Anti-pol Domain identifier */
#define TRDC_MDA_W0_5_ANTIPOL_DFMT1_DID_ANTIPOL(x) (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_5_ANTIPOL_DFMT1_DID_ANTIPOL_SHIFT)) & TRDC_MDA_W0_5_ANTIPOL_DFMT1_DID_ANTIPOL_MASK)

#define TRDC_MDA_W0_5_ANTIPOL_DFMT1_PA_ANTIPOL_MASK (0x30U)
#define TRDC_MDA_W0_5_ANTIPOL_DFMT1_PA_ANTIPOL_SHIFT (4U)
/*! PA_ANTIPOL - Anti-pol Privileged attribute
 *  0b00..Use the bus master's privileged/user attribute directly.
 *  0b01..Use the bus master's privileged/user attribute directly.
 *  0b10..Force the bus attribute for this master to privileged.
 *  0b11..Force the bus attribute for this master to user.
 */
#define TRDC_MDA_W0_5_ANTIPOL_DFMT1_PA_ANTIPOL(x) (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_5_ANTIPOL_DFMT1_PA_ANTIPOL_SHIFT)) & TRDC_MDA_W0_5_ANTIPOL_DFMT1_PA_ANTIPOL_MASK)

#define TRDC_MDA_W0_5_ANTIPOL_DFMT1_SA_ANTIPOL_MASK (0xC0U)
#define TRDC_MDA_W0_5_ANTIPOL_DFMT1_SA_ANTIPOL_SHIFT (6U)
/*! SA_ANTIPOL - Anti-pol Secure attribute
 *  0b00..Use the bus master's secure/nonsecure attribute directly.
 *  0b01..Use the bus master's secure/nonsecure attribute directly.
 *  0b10..Force the bus attribute for this master to nonsecure.
 *  0b11..Force the bus attribute for this master to secure.
 */
#define TRDC_MDA_W0_5_ANTIPOL_DFMT1_SA_ANTIPOL(x) (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_5_ANTIPOL_DFMT1_SA_ANTIPOL_SHIFT)) & TRDC_MDA_W0_5_ANTIPOL_DFMT1_SA_ANTIPOL_MASK)

