zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_TRDC.h
#define TRDC_MDA_W0_5_ANTIPOL_DFMT1_LK3_MASK     (0x40000000U)
#define TRDC_MDA_W0_5_ANTIPOL_DFMT1_LK3_SHIFT    (30U)
/*! LK3 - 1-bit Lock
 *  0b0..Register can be written by any secure privileged write.
 *  0b1..Register is locked (read-only) until the next reset.
 */
#define TRDC_MDA_W0_5_ANTIPOL_DFMT1_LK3(x)       (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_5_ANTIPOL_DFMT1_LK3_SHIFT)) & TRDC_MDA_W0_5_ANTIPOL_DFMT1_LK3_MASK)
/*! @} */

/*! @name MDA_W0_6_ANTIPOL_DFMT0 - DAC Master Domain Assignment Anti-pol Register */
/*! @{ */

#define TRDC_MDA_W0_6_ANTIPOL_DFMT0_DID_ANTIPOL_MASK (0xFU)
#define TRDC_MDA_W0_6_ANTIPOL_DFMT0_DID_ANTIPOL_SHIFT (0U)
/*! DID_ANTIPOL - Anti-pol Domain identifier */
#define TRDC_MDA_W0_6_ANTIPOL_DFMT0_DID_ANTIPOL(x) (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_6_ANTIPOL_DFMT0_DID_ANTIPOL_SHIFT)) & TRDC_MDA_W0_6_ANTIPOL_DFMT0_DID_ANTIPOL_MASK)

#define TRDC_MDA_W0_6_ANTIPOL_DFMT0_SA_ANTIPOL_MASK (0xC000U)
#define TRDC_MDA_W0_6_ANTIPOL_DFMT0_SA_ANTIPOL_SHIFT (14U)
/*! SA_ANTIPOL - Anti-pol Secure attribute
 *  0b00..Use the bus master's secure/nonsecure attribute directly.
 *  0b01..Use the bus master's secure/nonsecure attribute directly.
 *  0b10..Force the bus attribute for this master to nonsecure.
 *  0b11..Force the bus attribute for this master to secure.
 */
#define TRDC_MDA_W0_6_ANTIPOL_DFMT0_SA_ANTIPOL(x) (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_6_ANTIPOL_DFMT0_SA_ANTIPOL_SHIFT)) & TRDC_MDA_W0_6_ANTIPOL_DFMT0_SA_ANTIPOL_MASK)

#define TRDC_MDA_W0_6_ANTIPOL_DFMT0_LK3_MASK     (0x40000000U)
#define TRDC_MDA_W0_6_ANTIPOL_DFMT0_LK3_SHIFT    (30U)
/*! LK3 - 1-bit Lock
 *  0b0..Register can be written by any secure privileged write.
 *  0b1..Register is locked (read-only) until the next reset.
 */
#define TRDC_MDA_W0_6_ANTIPOL_DFMT0_LK3(x)       (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_6_ANTIPOL_DFMT0_LK3_SHIFT)) & TRDC_MDA_W0_6_ANTIPOL_DFMT0_LK3_MASK)
/*! @} */

/*! @name MDA_W0_7_ANTIPOL_DFMT1 - DAC Master Domain Assignment Anti-pol Register */
/*! @{ */

#define TRDC_MDA_W0_7_ANTIPOL_DFMT1_DID_ANTIPOL_MASK (0xFU)
#define TRDC_MDA_W0_7_ANTIPOL_DFMT1_DID_ANTIPOL_SHIFT (0U)
/*! DID_ANTIPOL - Anti-pol Domain identifier */
#define TRDC_MDA_W0_7_ANTIPOL_DFMT1_DID_ANTIPOL(x) (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_7_ANTIPOL_DFMT1_DID_ANTIPOL_SHIFT)) & TRDC_MDA_W0_7_ANTIPOL_DFMT1_DID_ANTIPOL_MASK)

#define TRDC_MDA_W0_7_ANTIPOL_DFMT1_PA_ANTIPOL_MASK (0x30U)
#define TRDC_MDA_W0_7_ANTIPOL_DFMT1_PA_ANTIPOL_SHIFT (4U)
/*! PA_ANTIPOL - Anti-pol Privileged attribute
 *  0b00..Use the bus master's privileged/user attribute directly.
 *  0b01..Use the bus master's privileged/user attribute directly.
 *  0b10..Force the bus attribute for this master to privileged.
 *  0b11..Force the bus attribute for this master to user.
 */
#define TRDC_MDA_W0_7_ANTIPOL_DFMT1_PA_ANTIPOL(x) (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_7_ANTIPOL_DFMT1_PA_ANTIPOL_SHIFT)) & TRDC_MDA_W0_7_ANTIPOL_DFMT1_PA_ANTIPOL_MASK)

#define TRDC_MDA_W0_7_ANTIPOL_DFMT1_SA_ANTIPOL_MASK (0xC0U)
#define TRDC_MDA_W0_7_ANTIPOL_DFMT1_SA_ANTIPOL_SHIFT (6U)
/*! SA_ANTIPOL - Anti-pol Secure attribute
 *  0b00..Use the bus master's secure/nonsecure attribute directly.
 *  0b01..Use the bus master's secure/nonsecure attribute directly.
 *  0b10..Force the bus attribute for this master to nonsecure.
 *  0b11..Force the bus attribute for this master to secure.
 */
#define TRDC_MDA_W0_7_ANTIPOL_DFMT1_SA_ANTIPOL(x) (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_7_ANTIPOL_DFMT1_SA_ANTIPOL_SHIFT)) & TRDC_MDA_W0_7_ANTIPOL_DFMT1_SA_ANTIPOL_MASK)

#define TRDC_MDA_W0_7_ANTIPOL_DFMT1_LK3_MASK     (0x40000000U)
#define TRDC_MDA_W0_7_ANTIPOL_DFMT1_LK3_SHIFT    (30U)
/*! LK3 - 1-bit Lock
 *  0b0..Register can be written by any secure privileged write.
 *  0b1..Register is locked (read-only) until the next reset.
 */
#define TRDC_MDA_W0_7_ANTIPOL_DFMT1_LK3(x)       (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W0_7_ANTIPOL_DFMT1_LK3_SHIFT)) & TRDC_MDA_W0_7_ANTIPOL_DFMT1_LK3_MASK)
/*! @} */

/*! @name MBC_MEM_GLBCFG - MBC Global Configuration Register */
/*! @{ */

#define TRDC_MBC_MEM_GLBCFG_NBLKS_MASK           (0x3FFU)
#define TRDC_MBC_MEM_GLBCFG_NBLKS_SHIFT          (0U)
/*! NBLKS - Number of blocks in this memory */
#define TRDC_MBC_MEM_GLBCFG_NBLKS(x)             (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_MEM_GLBCFG_NBLKS_SHIFT)) & TRDC_MBC_MEM_GLBCFG_NBLKS_MASK)

#define TRDC_MBC_MEM_GLBCFG_SIZE_LOG2_MASK       (0x1F0000U)
#define TRDC_MBC_MEM_GLBCFG_SIZE_LOG2_SHIFT      (16U)
/*! SIZE_LOG2 - Log2 size per block */
#define TRDC_MBC_MEM_GLBCFG_SIZE_LOG2(x)         (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_MEM_GLBCFG_SIZE_LOG2_SHIFT)) & TRDC_MBC_MEM_GLBCFG_SIZE_LOG2_MASK)
/*! @} */

/* The count of TRDC_MBC_MEM_GLBCFG */
#define TRDC_MBC_MEM_GLBCFG_COUNT                (5U)

/* The count of TRDC_MBC_MEM_GLBCFG */
#define TRDC_MBC_MEM_GLBCFG_COUNT2               (4U)

/*! @name MBC_NSE_BLK_INDEX - MBC NonSecure Enable Block Index */
/*! @{ */

#define TRDC_MBC_NSE_BLK_INDEX_AI_MASK           (0x1U)
#define TRDC_MBC_NSE_BLK_INDEX_AI_SHIFT          (0U)
/*! AI - Auto Increment
 *  0b0..No effect.
 *  0b1..Add 1 to the WNDX field after the register write.
 */
#define TRDC_MBC_NSE_BLK_INDEX_AI(x)             (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_NSE_BLK_INDEX_AI_SHIFT)) & TRDC_MBC_NSE_BLK_INDEX_AI_MASK)

#define TRDC_MBC_NSE_BLK_INDEX_WNDX_MASK         (0x3CU)
#define TRDC_MBC_NSE_BLK_INDEX_WNDX_SHIFT        (2U)
/*! WNDX - Word index into the block NSE bitmap. It selects the BLK_NSE_Wn register, where WNDX determines the value of n. */
#define TRDC_MBC_NSE_BLK_INDEX_WNDX(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_NSE_BLK_INDEX_WNDX_SHIFT)) & TRDC_MBC_NSE_BLK_INDEX_WNDX_MASK)

#define TRDC_MBC_NSE_BLK_INDEX_MEM_SEL_MASK      (0xF00U)
#define TRDC_MBC_NSE_BLK_INDEX_MEM_SEL_SHIFT     (8U)
/*! MEM_SEL - Memory Select */
#define TRDC_MBC_NSE_BLK_INDEX_MEM_SEL(x)        (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_NSE_BLK_INDEX_MEM_SEL_SHIFT)) & TRDC_MBC_NSE_BLK_INDEX_MEM_SEL_MASK)

#define TRDC_MBC_NSE_BLK_INDEX_DID_SEL0_MASK     (0x10000U)
#define TRDC_MBC_NSE_BLK_INDEX_DID_SEL0_SHIFT    (16U)
/*! DID_SEL0 - DID Select
 *  0b0..No effect.
 *  0b1..Selects NSE bits for this domain.
 */
#define TRDC_MBC_NSE_BLK_INDEX_DID_SEL0(x)       (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_NSE_BLK_INDEX_DID_SEL0_SHIFT)) & TRDC_MBC_NSE_BLK_INDEX_DID_SEL0_MASK)

